let wifusDict = {
  "推进之王": [6, new Set([
    [
      "高级资深干员",
      "先锋干员",
    ],
    [
      "高级资深干员",
      "费用回复",
    ],
    [
      "高级资深干员",
      "输出",
      "费用回复",
    ],
    [
      "高级资深干员",
      "先锋干员",
      "费用回复",
    ],
    [
      "高级资深干员",
      "先锋干员",
      "输出",
    ],
    [
      "高级资深干员",
      "先锋干员",
      "近战位",
    ],
    [
      "高级资深干员",
      "近战位",
      "费用回复",
    ],
  ])],
  "德克萨斯": [6, new Set([
    [
      "控场",
      "费用回复",
    ],
    [
      "先锋干员",
      "控场",
    ],
    [
      "近战位",
      "控场",
      "费用回复",
    ],
    [
      "先锋干员",
      "近战位",
      "控场",
    ],
    [
      "先锋干员",
      "控场",
      "费用回复",
    ],
    [
      "资深干员",
      "先锋干员",
      "控场",
    ],
    [
      "资深干员",
      "控场",
      "费用回复",
    ],
    [
      "资深干员",
      "控场",
      "费用回复",
    ],
    [
      "近战位",
      "控场",
      "50% 红", // 红
    ],
    [
      "资深干员",
      "近战位",
      "控场",
      "50% 红", // 红
    ],
  ])],
  "凛冬": [5, new Set([
    [
      "支援",
      "费用回复",
    ],
    [
      "先锋干员",
      "支援",
    ],
    [
      "先锋干员",
      "支援",
      "费用回复",
    ],
    [
      "先锋干员",
      "近战位",
      "支援",
    ],
    [
      "近战位",
      "支援",
      "费用回复",
    ],
    [
      "资深干员",
      "近战位",
      "支援",
      "50% 诗怀雅", // 诗怀雅
    ],
    [
      "资深干员",
      "支援",
      "费用回复",
    ],
    [
      "资深干员",
      "先锋干员",
      "支援",
    ],
  ])],
  "桃金娘": [4, new Set([
    [
      "治疗",
      "费用回复",
    ],
    [
      "先锋干员",
      "治疗",
    ],
    [
      "先锋干员",
      "治疗",
      "费用回复",
    ],
    [
      "近战位",
      "治疗",
      "费用回复",
    ],
    [
      "先锋干员",
      "近战位",
      "治疗",
    ],
  ])],
  "斯卡蒂": [6, new Set([
    [
      "高级资深干员",
      "生存",
      "50% 赫拉格", // 赫拉格
    ],
    [
      "高级资深干员",
      "近卫干员",
      "生存",
      "50% 赫拉格", // 赫拉格
    ],
    [
      "高级资深干员",
      "输出",
      "生存",
      "50% 赫拉格", // 赫拉格
    ],
    [
      "高级资深干员",
      "近战位",
      "生存",
      "50% 赫拉格", // 赫拉格
    ],
  ])],
  "银灰": [6, new Set([
    [
      "高级资深干员",
      "近卫干员",
      "支援",
    ],
    [
      "高级资深干员",
      "支援",
      "输出",
      "50% 麦哲伦", // 麦哲伦
    ],
  ])],
  "陈": [6, new Set([
    [
      "高级资深干员",
      "爆发",
    ],
    [
      "高级资深干员",
      "爆发",
      "输出",
    ],
    [
      "高级资深干员",
      "爆发",
      "近战位",
    ],
    [
      "高级资深干员",
      "爆发",
      "近卫干员",
    ],
  ])],
  "赫拉格": [6, new Set([
    [
      "高级资深干员",
      "生存",
      "50% 斯卡蒂", // 斯卡蒂
    ],
    [
      "高级资深干员",
      "近卫干员",
      "生存",
      "50% 斯卡蒂", // 斯卡蒂
    ],
    [
      "高级资深干员",
      "输出",
      "生存",
      "50% 斯卡蒂", // 斯卡蒂
    ],
    [
      "高级资深干员",
      "近战位",
      "生存",
      "50% 斯卡蒂", // 斯卡蒂
    ],
  ])],
  "因陀罗": [5, new Set([
    [
      "资深干员",
      "近卫干员",
      "输出",
      "33% 星极, 诗怀雅", // 星极, 诗怀雅
    ],
  ])],
  "诗怀雅": [5, new Set([
    [
      "资深干员",
      "支援",
      "输出",
    ],
    [
      "资深干员",
      "支援",
      "近卫干员",
    ],
    [
      "资深干员",
      "支援",
      "近战位",
      "50% 凛冬", // 凛冬
    ],
    [
      "资深干员",
      "近卫干员",
      "输出",
      "33% 星极, 因陀罗", // 星极, 因陀罗
    ],
  ])],
  "星极": [5, new Set([
    [
      "近卫干员",
      "防护",
    ],
    [
      "近卫干员",
      "输出",
      "防护",
    ],
    [
      "资深干员",
      "近卫干员",
      "防护",
    ],
    [
      "输出",
      "防护",
      "33% 火神, 雷蛇", // 火神, 雷蛇
    ],
    [
      "近战位",
      "输出",
      "防护",
      "33% 火神, 雷蛇", // 火神, 雷蛇
    ],
    [
      "资深干员",
      "输出",
      "防护",
      "33% 火神, 雷蛇", // 火神, 雷蛇
    ],
    [
      "资深干员",
      "近卫干员",
      "输出",
      "33% 因陀罗, 诗怀雅", // 因陀罗, 诗怀雅
    ],
  ])],
  "幽灵鲨": [5, new Set([
    [
      "资深干员",
      "近卫干员",
      "群攻",
    ],
    [
      "资深干员",
      "近战位",
      "群攻",
    ],
    [
      "资深干员",
      "群攻",
      "生存",
    ],
  ])],
  "霜叶": [4, new Set([
    [
      "输出",
      "减速",
      "小概率高星 真理, 夜魔", // 真理, 夜魔
    ],
    [
      "近战位",
      "减速",
      "小概率高星 食铁兽", // 食铁兽
    ],
    [
      "近卫干员",
      "减速",
    ],
    [
      "近卫干员",
      "近战位",
      "减速",
    ],
    [
      "近卫干员",
      "输出",
      "减速",
    ],
    [
      "近战位",
      "输出",
      "减速",
    ],
  ])],
  "杜宾": [4, new Set([
    [
      "支援",
      "输出",
      "小概率高星 诗怀雅", // 诗怀雅
    ],
    [
      "近战位",
      "支援",
      "输出",
      "小概率高星 诗怀雅", // 诗怀雅
    ],
    [
      "近卫干员",
      "支援",
      "输出",
      "小概率高星 诗怀雅", // 诗怀雅
    ],
    [
      "近战位",
      "支援",
      "小概率高星 凛冬, 诗怀雅", // 凛冬, 诗怀雅
    ],
    [
      "近卫干员",
      "支援",
    ],
    [
      "近战位",
      "近卫干员",
      "支援",
    ],
  ])],
  "Castle-3": [1, new Set([
    [
      "支援",
      "支援机械",
    ],
    [
      "近卫干员",
      "支援机械",
    ],
    [
      "近战位",
      "支援机械",
      "50% THRM-EX", // THRM-EX
    ],
    [
      "近战位",
      "支援",
      "支援机械",
    ],
    [
      "近卫干员",
      "支援机械",
      "支援",
    ],
    [
      "近卫干员",
      "近战位",
      "支援机械",
    ],
    [
      "支援机械",
      "33% THRM-EX, Lancet-2", // THRM-EX, Lancet-2
    ],
  ])],
  "能天使": [6, new Set([
    [
      "高级资深干员",
      "狙击干员",
      "50% 黑", // 黑
    ],
    [
      "高级资深干员",
      "狙击干员",
      "输出",
      "50% 黑", // 黑
    ],
    [
      "高级资深干员",
      "狙击干员",
      "远程位",
      "50% 黑", // 黑
    ],
  ])],
  "黑": [6, new Set([
    [
      "高级资深干员",
      "狙击干员",
      "50% 能天使", // 能天使
    ],
    [
      "高级资深干员",
      "狙击干员",
      "输出",
      "50% 能天使", // 能天使
    ],
    [
      "高级资深干员",
      "狙击干员",
      "远程位",
      "50% 能天使", // 能天使
    ],
  ])],
  "陨星": [5, new Set([
    [
      "群攻",
      "削弱",
    ],
    [
      "狙击干员",
      "群攻",
      "削弱",
    ],
    [
      "远程位",
      "群攻",
      "削弱",
    ],
    [
      "资深干员",
      "远程位",
      "群攻",
      "50% 送葬人", // 送葬人
    ],
    [
      "资深干员",
      "狙击干员",
      "群攻",
      "50% 送葬人", // 送葬人
    ],
    [
      "资深干员",
      "群攻",
      "削弱",
    ],
    [
      "资深干员",
      "狙击干员",
      "削弱",
    ],
  ])],
  "守林人": [5, new Set([
    [
      "爆发",
    ],
    [
      "输出",
      "爆发",
    ],
    [
      "狙击干员",
      "爆发",
    ],
    [
      "远程位",
      "爆发",
    ],
    [
      "狙击干员",
      "远程位",
      "爆发",
    ],
    [
      "狙击干员",
      "输出",
      "爆发",
    ],
    [
      "远程位",
      "输出",
      "爆发",
    ],
    [
      "资深干员",
      "爆发",
    ],
    [
      "资深干员",
      "输出",
      "爆发",
    ],
    [
      "资深干员",
      "狙击干员",
      "爆发",
    ],
    [
      "资深干员",
      "远程位",
      "爆发",
    ],
  ])],
  "送葬人": [5, new Set([
    [
      "资深干员",
      "远程位",
      "群攻",
      "50% 陨星", // 陨星
    ],
    [
      "资深干员",
      "狙击干员",
      "群攻",
      "50% 陨星", // 陨星
    ],
  ])],
  "杰西卡": [4, new Set([
    [
      "远程位",
      "生存",
    ],
    [
      "狙击干员",
      "生存",
    ],
    [
      "狙击干员",
      "输出",
      "生存",
    ],
    [
      "狙击干员",
      "远程位",
      "生存",
    ],
    [
      "输出",
      "远程位",
      "生存",
    ],
  ])],
  "流星": [4, new Set([
    [
      "狙击干员",
      "削弱",
      "小概率高星 陨星", // 陨星
    ],
    [
      "狙击干员",
      "远程位",
      "削弱",
      "小概率高星 陨星", // 陨星
    ],
    [
      "狙击干员",
      "输出",
      "削弱",
    ],
    [
      "削弱",
      "50% 夜烟", // 夜烟
      "小概率高星 陨星, 初雪", // 陨星, 初雪
    ],
    [
      "远程位",
      "削弱",
      "50% 夜烟", // 夜烟
      "小概率高星 陨星, 初雪", // 陨星, 初雪
    ],
    [
      "输出",
      "削弱",
      "50% 夜烟", // 夜烟
    ],
    [
      "远程位",
      "输出",
      "削弱",
      "50% 夜烟", // 夜烟
    ],
  ])],
  "白雪": [4, new Set([
    [
      "狙击干员",
      "群攻",
      "减速",
    ],
    [
      "狙击干员",
      "减速",
      "50% 梅", // 梅
    ],
    [
      "狙击干员",
      "远程位",
      "减速",
      "50% 梅", // 梅
    ],
    [
      "群攻",
      "减速",
      "50% 格雷伊", // 格雷伊
    ],
    [
      "远程位",
      "群攻",
      "减速",
      "50% 格雷伊", // 格雷伊
    ],
  ])],
  "梅": [4, new Set([
    [
      "狙击干员",
      "输出",
      "减速",
    ],
    [
      "远程位",
      "输出",
      "减速",
    ],
    [
      "输出",
      "减速",
      "50% 霜叶", // 霜叶
    ],
    [
      "狙击干员",
      "减速",
      "50% 白雪", // 白雪
    ],
    [
      "狙击干员",
      "远程位",
      "减速",
      "50% 白雪", // 白雪
    ],
  ])],
  "赛雷亚": [6, new Set([
    [
      "高级资深干员",
      "重装干员",
      "支援",
    ],
    [
      "高级资深干员",
      "近战位",
      "治疗",
    ],
    [
      "高级资深干员",
      "防护",
      "支援",
    ],
    [
      "高级资深干员",
      "治疗",
      "防护",
    ],
    [
      "高级资深干员",
      "治疗",
      "重装干员",
    ],
  ])],
  "星熊": [6, new Set([
    [
      "高级资深干员",
      "防护",
      "输出",
    ],
    [
      "高级资深干员",
      "重装干员",
      "输出",
    ],
  ])],
  "火神": [5, new Set([
    [
      "重装干员",
      "生存",
    ],
    [
      "生存",
      "防护",
    ],
    [
      "输出",
      "生存",
      "防护",
    ],
    [
      "重装干员",
      "近战位",
      "生存",
    ],
    [
      "重装干员",
      "输出",
      "生存",
    ],
    [
      "重装干员",
      "生存",
      "防护",
    ],
    [
      "近战位",
      "生存",
      "防护",
    ],
    [
      "资深干员",
      "重装干员",
      "生存",
    ],
    [
      "资深干员",
      "生存",
      "防护",
    ],
  ])],
  "可颂": [5, new Set([
    [
      "防护",
      "位移",
    ],
    [
      "重装干员",
      "位移",
    ],
    [
      "重装干员",
      "近战位",
      "位移",
    ],
    [
      "重装干员",
      "防护",
      "位移",
    ],
    [
      "近战位",
      "防护",
      "位移",
    ],
    [
      "资深干员",
      "防护",
      "位移",
    ],
    [
      "资深干员",
      "重装干员",
      "位移",
    ],
  ])],
  "雷蛇": [5, new Set([
    [
      "重装干员",
      "输出",
      "50% 火神", // 火神
    ],
    [
      "资深干员",
      "重装干员",
      "输出",
      "50% 火神", // 火神
    ],
    [
      "重装干员",
      "近战位",
      "输出",
      "50% 火神", // 火神
    ],
    [
      "重装干员",
      "输出",
      "防护",
      "50% 火神", // 火神
    ],
    [
      "近战位",
      "输出",
      "防护",
      "33% 火神, 星极", // 火神, 星极
    ],
    [
      "防护",
      "输出",
      "33% 火神, 星极", // 火神, 星极
    ],
    [
      "资深干员",
      "输出",
      "防护",
      "33% 火神, 星极", // 火神, 星极
    ],
  ])],
  "临光": [5, new Set([
    [
      "资深干员",
      "近战位",
      "治疗",
      "50% 火神", // 火神
    ],
    [
      "资深干员",
      "防护",
      "治疗",
      "50% 火神", // 火神
    ],
    [
      "资深干员",
      "重装干员",
      "治疗",
      "50% 火神", // 火神
    ],
  ])],
  "闪灵": [6, new Set([
    [
      "高级资深干员",
      "医疗干员",
      "50% 夜莺", // 夜莺
    ],
    [
      "高级资深干员",
      "医疗干员",
      "支援",
      "50% 夜莺", // 夜莺
    ],
    [
      "高级资深干员",
      "远程位",
      "治疗",
      "50% 夜莺", // 夜莺
    ],
    [
      "高级资深干员",
      "远程位",
      "支援",
      "50% 夜莺", // 夜莺
    ],
    [
      "高级资深干员",
      "医疗干员",
      "远程位",
      "50% 夜莺", // 夜莺
    ],
    [
      "高级资深干员",
      "医疗干员",
      "治疗",
      "50% 夜莺", // 夜莺
    ],
  ])],
  "夜莺": [6, new Set([
    [
      "高级资深干员",
      "医疗干员",
      "50% 闪灵", // 闪灵
    ],
    [
      "高级资深干员",
      "医疗干员",
      "支援",
      "50% 闪灵", // 闪灵
    ],
    [
      "高级资深干员",
      "远程位",
      "治疗",
      "50% 闪灵", // 闪灵
    ],
    [
      "高级资深干员",
      "远程位",
      "支援",
      "50% 闪灵", // 闪灵
    ],
    [
      "高级资深干员",
      "医疗干员",
      "远程位",
      "50% 闪灵", // 闪灵
    ],
    [
      "高级资深干员",
      "医疗干员",
      "治疗",
      "50% 闪灵", // 闪灵
    ],
  ])],
  "白面鸮": [5, new Set([
    [
      "资深干员",
      "医疗干员",
      "支援",
      "50% 华法琳", // 华法琳
    ],
    [
      "资深干员",
      "治疗",
      "支援",
      "50% 华法琳", // 华法琳
    ],
    [
      "资深干员",
      "远程位",
      "支援",
      "50% 华法琳", // 华法琳
    ],
  ])],
  "华法琳": [5, new Set([
    [
      "资深干员",
      "医疗干员",
      "支援",
      "50% 白面鸮", // 白面鸮
    ],
    [
      "资深干员",
      "治疗",
      "支援",
      "50% 白面鸮", // 白面鸮
    ],
    [
      "资深干员",
      "远程位",
      "支援",
      "50% 白面鸮", // 白面鸮
    ],
  ])],
  "麦哲伦": [6, new Set([
    [
      "高级资深干员",
      "减速",
    ],
    [
      "高级资深干员",
      "支援",
      "减速",
    ],
    [
      "高级资深干员",
      "输出",
      "减速",
    ],
    [
      "高级资深干员",
      "减速",
      "远程位",
    ],
    [
      "高级资深干员",
      "辅助干员",
    ],
    [
      "高级资深干员",
      "辅助干员",
      "减速",
    ],
    [
      "高级资深干员",
      "辅助干员",
      "输出",
    ],
    [
      "高级资深干员",
      "辅助干员",
      "支援",
    ],
    [
      "高级资深干员",
      "辅助干员",
      "远程位",
    ],
    [
      "高级资深干员",
      "支援",
      "输出",
      "50% 银灰", // 银灰
    ],
  ])],
  "真理": [5, new Set([
    [
      "辅助干员",
      "输出",
    ],
    [
      "辅助干员",
      "输出",
      "减速"
    ],
    [
      "辅助干员",
      "远程位",
      "输出",
    ],
    [
      "资深干员",
      "辅助干员",
      "输出",
    ],
    [
      "资深干员",
      "辅助干员",
      "减速",
      "50% 格劳克斯", // 格劳克斯
    ],
    [
      "资深干员",
      "远程位",
      "减速",
      "33% 夜魔, 格劳克斯", // 夜魔, 格劳克斯
    ],
    [
      "资深干员",
      "输出",
      "减速",
      "50% 夜魔", // 夜魔
    ],
  ])],
  "格劳克斯": [5, new Set([
    [
      "减速",
      "控场",
    ],
    [
      "辅助干员",
      "减速",
      "控场"
    ],
    [
      "远程位",
      "减速",
      "控场"
    ],
    [
      "辅助干员",
      "控场",
      "50% 梅尔", // 梅尔
    ],
    [
      "远程位",
      "控场",
      "50% 梅尔", // 梅尔
    ],
    [
      "资深干员",
      "辅助干员",
      "控场",
      "50% 梅尔", // 梅尔
    ],
    [
      "资深干员",
      "远程位",
      "控场",
      "50% 梅尔", // 梅尔
    ],
    [
      "资深干员",
      "辅助干员",
      "减速",
      "50% 梅尔", // 梅尔
    ],
    [
      "资深干员",
      "远程位",
      "减速",
      "33% 夜魔, 真理", // 夜魔, 真理
    ],
  ])],
  "初雪": [5, new Set([
    [
      "辅助干员",
      "削弱",
    ],
    [
      "辅助干员",
      "远程位",
      "削弱",
    ],
    [
      "资深干员",
      "辅助干员",
      "削弱",
    ],
    [
      "资深干员",
      "削弱",
      "50% 陨星", // 陨星
    ],
    [
      "资深干员",
      "远程位",
      "削弱",
      "50% 陨星", // 陨星
    ],
  ])],
  "清流": [4, new Set([
    [
      "治疗",
      "支援",
    ],
    [
      "远程位",
      "支援",
    ],
    [
      "医疗干员",
      "支援",
    ],
    [
      "医疗干员",
      "治疗",
      "支援",
    ],
    [
      "医疗干员",
      "远程位",
      "支援",
    ],
    [
      "治疗",
      "远程位",
      "支援",
    ],
    [
      "支援",
      "50% 杜宾", // 杜宾
    ],
  ])],
  "Lancet-2": [1, new Set([
    [
      "治疗",
      "支援机械",
    ],
    [
      "医疗干员",
      "支援机械",
    ],
    [
      "远程位",
      "支援机械",
    ],
    [
      "远程位",
      "治疗",
      "支援机械",
    ],
    [
      "医疗干员",
      "治疗",
      "支援机械",
    ],
    [
      "医疗干员",
      "远程位",
      "支援机械",
    ],
    [
      "支援机械",
      "33% THRM-EX, Castle-3", // THRM-EX, Castle-3
    ],
  ])],
  "梅尔": [5, new Set([
    [
      "远程位",
      "控场",
      "召唤",
    ],
    [
      "召唤",
    ],
    [
      "辅助干员",
      "控场",
      "50% 格劳克斯", // 格劳克斯
    ],
    [
      "辅助干员",
      "召唤",
    ],
    [
      "远程位",
      "召唤",
    ],
    [
      "远程位",
      "控场",
      "50% 格劳克斯", // 格劳克斯
    ],
    [
      "控场",
      "召唤",
    ],
    [
      "辅助干员",
      "控场",
      "召唤",
    ],
    [
      "辅助干员",
      "远程位",
      "控场",
    ],
    [
      "辅助干员",
      "远程位",
      "召唤",
    ],
    [
      "资深干员",
      "召唤",
    ],
    [
      "资深干员",
      "辅助干员",
      "控场",
      "50% 格劳克斯", // (这里视频错了)
    ],
    [
      "资深干员",
      "辅助干员",
      "召唤",
    ],
    [
      "资深干员",
      "远程位",
      "召唤",
    ],
    [
      "资深干员",
      "远程位",
      "控场",
      "50% 格劳克斯", // (这里视频错了)
    ],
    [
      "资深干员",
      "控场",
      "召唤",
      "50% 格劳克斯", // 格劳克斯
    ],
  ])],
  "伊芙丽特": [6, new Set([
    [
      "高级资深干员",
      "削弱",
    ],
    [
      "高级资深干员",
      "远程位",
      "削弱",
    ],
    [
      "高级资深干员",
      "术师干员",
      "削弱",
    ],
    [
      "高级资深干员",
      "群攻",
      "削弱",
    ],
    [
      "高级资深干员",
      "术师干员",
      "远程位",
      "50% 莫斯提马", // 莫斯提马
    ],
    [
      "高级资深干员",
      "术师干员",
      "群攻",
      "50% 莫斯提马", // 莫斯提马
    ],
    [
      "高级资深干员",
      "远程位",
      "群攻",
      "50% 莫斯提马", // 莫斯提马
    ],
    [
      "高级资深干员",
      "术师干员",
      "50% 莫斯提马", // 莫斯提马
    ],
    [
      "高级资深干员",
      "群攻",
      "50% 莫斯提马", // 莫斯提马
    ],
  ])],
  "莫斯提马": [6, new Set([
    [
      "高级资深干员",
      "控场",
    ],
    [
      "高级资深干员",
      "支援",
      "控场",
    ],
    [
      "高级资深干员",
      "术师干员",
      "控场",
    ],
    [
      "高级资深干员",
      "远程位",
      "控场",
    ],
    [
      "高级资深干员",
      "术师干员",
      "远程位",
      "50% 伊芙丽特", // 伊芙丽特
    ],
    [
      "高级资深干员",
      "术师干员",
      "群攻",
      "50% 伊芙丽特", // 伊芙丽特
    ],
    [
      "高级资深干员",
      "远程位",
      "群攻",
      "50% 伊芙丽特", // 伊芙丽特
    ],
    [
      "高级资深干员",
      "术师干员",
      "50% 伊芙丽特", // 伊芙丽特
    ],
    [
      "高级资深干员",
      "群攻",
      "50% 伊芙丽特", // 伊芙丽特
    ],
  ])],
  "夜魔": [5, new Set([
    [
      "治疗",
      "减速",
    ],
    [
      "治疗",
      "输出",
    ],
    [
      "术师干员",
      "治疗",
    ],
    [
      "治疗",
      "输出",
      "减速",
    ],
    [
      "术师干员",
      "远程位",
      "治疗",
    ],
    [
      "术师干员",
      "治疗",
      "减速",
    ],
    [
      "术师干员",
      "治疗",
      "输出",
    ],
    [
      "远程位",
      "治疗",
      "减速",
    ],
    [
      "术师干员",
      "输出",
      "减速",
    ],
    [
      "资深干员",
      "术师干员",
    ],
    [
      "资深干员",
      "术师干员",
      "远程位",
    ],
    [
      "资深干员",
      "术师干员",
      "输出",
    ],
    [
      "资深干员",
      "治疗",
      "减速",
    ],
    [
      "资深干员",
      "治疗",
      "输出",
    ],
    [
      "资深干员",
      "术师干员",
      "治疗",
    ],
    [
      "资深干员",
      "输出",
      "减速",
    ],
    [
      "资深干员",
      "远程位",
      "减速",
      "33% 真理, 格劳克斯", // 真理, 格劳克斯
    ],
  ])],
  "夜烟": [4, new Set([
    [
      "术师干员",
      "削弱",
    ],
    [
      "术师干员",
      "远程位",
      "削弱",
    ],
    [
      "术师干员",
      "输出",
      "削弱",
    ],
    [
      "削弱",
      "50% 流星", // 流星
      "小概率高星 陨星, 初雪", // 陨星, 初雪
    ],
    [
      "远程位",
      "削弱",
      "50% 流星", // 流星
      "小概率高星 陨星, 初雪", // 陨星, 初雪
    ],
    [
      "输出",
      "削弱",
      "50% 流星", // 流星
    ],
    [
      "远程位",
      "输出",
      "削弱",
      "50% 流星", // 流星
    ],
  ])],
  "格雷伊": [4, new Set([
    [
      "术师干员",
      "减速",
      "小概率同星 夜魔", // 夜魔
    ],
    [
      "术师干员",
      "远程位",
      "减速",
      "小概率同星 夜魔", // 夜魔
    ],
    [
      "术师干员",
      "群攻",
      "减速",
    ],
    [
      "群攻",
      "减速",
      "50% 白雪", // 白雪
    ],
    [
      "远程位",
      "群攻",
      "减速",
      "50% 白雪", // 白雪
    ],
  ])],
  "食铁兽": [5, new Set([
    [
      "特种干员",
      "减速",
    ],
    [
      "减速",
      "位移",
    ],
    [
      "资深干员",
      "近战位",
      "减速",
    ],
    [
      "特种干员",
      "减速",
      "位移",
    ],
    [
      "特种干员",
      "近战位",
      "减速",
    ],
    [
      "近战位",
      "减速",
      "位移",
    ],
    [
      "资深干员",
      "特种干员",
      "减速",
    ],
    [
      "资深干员",
      "减速",
      "位移",
    ],
    [
      "资深干员",
      "特种干员",
      "位移",
      "50% 崖心", // 崖心
    ],
  ])],
  "狮蝎": [5, new Set([
    [
      "特种干员",
      "生存",
    ],
    [
      "特种干员",
      "近战位",
      "生存",
    ],
    [
      "特种干员",
      "输出",
      "生存",
    ],
    [
      "资深干员",
      "特种干员",
      "生存",
    ],
    [
      "特种干员",
      "输出",
      "50% 崖心", // 崖心
    ],
    [
      "特种干员",
      "近战位",
      "输出",
      "50% 崖心", // 崖心
    ],
    [
      "资深干员",
      "特种干员",
      "输出",
      "50% 崖心", // 崖心
    ],
  ])],
  "崖心": [5, new Set([
    [
      "输出",
      "位移",
    ],
    [
      "特种干员",
      "输出",
      "位移",
    ],
    [
      "近战位",
      "输出",
      "位移",
    ],
    [
      "资深干员",
      "输出",
      "位移",
    ],
    [
      "特种干员",
      "输出",
      "50% 狮蝎", // 狮蝎
    ],
    [
      "特种干员",
      "近战位",
      "输出",
      "50% 狮蝎", // 狮蝎
    ],
    [
      "资深干员",
      "特种干员",
      "输出",
      "50% 狮蝎", // 狮蝎
    ],
    [
      "资深干员",
      "特种干员",
      "位移",
      "50% 食铁兽", // 食铁兽
    ],
  ])],
  "红": [5, new Set([
    [
      "控场",
      "快速复活",
    ],
    [
      "特种干员",
      "控场",
    ],
    [
      "特种干员",
      "近战位",
      "控场",
    ],
    [
      "特种干员",
      "控场",
      "快速复活",
    ],
    [
      "近战位",
      "控场",
      "快速复活",
    ],
    [
      "资深干员",
      "控场",
      "快速复活",
    ],
    [
      "资深干员",
      "特种干员",
      "控场",
    ],
    [
      "资深干员",
      "特种干员",
      "快速复活",
      "50% 槐琥", // 槐琥
    ],
    [
      "资深干员",
      "近战位",
      "快速复活",
      "50% 槐琥", // 槐琥
    ],
    [
      "资深干员",
      "快速复活",
      "50% 槐琥", // 槐琥
    ],
    [
      "近战位",
      "控场",
      "50% 德克萨斯", // 德克萨斯
    ],
    [
      "资深干员",
      "近战位",
      "控场",
      "50% 德克萨斯", // 德克萨斯
    ],
  ])],
  "槐琥": [5, new Set([
    [
      "特种干员",
      "削弱",
    ],
    [
      "快速复活",
      "削弱",
    ],
    [
      "近战位",
      "削弱",
    ],
    [
      "资深干员",
      "特种干员",
      "快速复活",
      "50% 红", // 红
    ],
    [
      "资深干员",
      "近战位",
      "快速复活",
      "50% 红", // 红
    ],
    [
      "资深干员",
      "快速复活",
      "50% 红", // 红
    ],
    [
      "资深干员",
      "削弱",
    ],
  ])],
  "砾": [4, new Set([
    [
      "防护",
      "快速复活",
    ],
    [
      "特种干员",
      "防护",
    ],
    [
      "特种干员",
      "近战位",
      "防护",
    ],
    [
      "特种干员",
      "防护",
      "快速复活",
    ],
    [
      "近战位",
      "防护",
      "快速复活",
    ],
    [
      "快速复活",
      "50% 红", // 红
    ],
    [
      "近战位",
      "快速复活",
      "50% 红", // 红
    ],
    [
      "特种干员",
      "快速复活",
      "50% 红", // 红
    ],
    [
      "特种干员",
      "近战位",
      "快速复活",
      "50% 红", // 红
    ],
  ])],
  "阿消": [4, new Set([
    [
      "位移",
      "50% 暗锁", // 暗锁
    ],
    [
      "近战位",
      "位移",
      "50% 暗锁", // 暗锁
    ],
    [
      "特种干员",
      "位移",
      "50% 暗锁", // 暗锁
    ],
    [
      "特种干员",
      "近战位",
      "位移",
      "50% 暗锁", // 暗锁
    ],
    [
      "特种干员",
      "33% 暗锁, 砾", // 暗锁, 砾
    ],
    [
      "特种干员",
      "近战位",
      "33% 暗锁, 砾", // 暗锁, 砾
    ],
  ])],
  "暗锁": [4, new Set([
    [
      "位移",
      "50% 阿消", // 阿消
    ],
    [
      "近战位",
      "位移",
      "50% 阿消", // 阿消
    ],
    [
      "特种干员",
      "位移",
      "50% 阿消", // 阿消
    ],
    [
      "特种干员",
      "近战位",
      "位移",
      "50% 阿消", // 阿消
    ],
    [
      "特种干员",
      "33% 阿消, 砾", // 阿消, 砾
    ],
    [
      "特种干员",
      "近战位",
      "33% 阿消, 砾", // 阿消, 砾
    ],
  ])],
  "THRM-EX": [1, new Set([
    [
      "爆发",
      "支援机械",
    ],
    [
      "近战位",
      "爆发",
    ],
    [
      "特种干员",
      "支援机械",
    ],
    [
      "特种干员",
      "爆发",
    ],
    [
      "近战位",
      "爆发",
      "支援机械",
    ],
    [
      "特种干员",
      "爆发",
      "支援机械",
    ],
    [
      "特种干员",
      "近战位",
      "支援机械",
    ],
    [
      "特种干员",
      "近战位",
      "爆发",
    ],
    [
      "近战位",
      "支援机械",
      "50% Castle-3", // Castle-3
    ],
    [
      "支援机械",
      "33% Castle-3, Lancet-2", // Castle-3, Lancet-2
    ],
  ])],
};

let validTags = ["医疗干员", "重装干员", "术师干员", "狙击干员", "先锋干员", "辅助干员", "近卫干员", "特种干员",
  "近战位", "远程位", "新手", "资深干员", "高级资深干员", "支援机械",
  "输出", "防护", "生存", "治疗", "群攻", "减速", "费用回复",
  "支援", "削弱", "位移", "召唤", "控场", "爆发", "快速复活",]

let selected = new Set();

let result5Star = [];
let result4Star = [];
let result3Star = [];
let result2Star = [];
let result1Star = [];

// set: user's input list
// elem: required tag string
function isSuperset(set, subset) {
  for (let elem of subset) {
    if (!validTags.includes(elem)) continue;
    if (!set.has(elem)) {
      return false;
    }
  }
  console.log(set);
  return true;
}

function getStars(stars) {
  switch (stars) {
    case 6:
      return "★★★★★★";
    case 5:
      return "★★★★★☆";
    case 4:
      return "★★★★☆☆";
    case 3:
      return "★★★☆☆☆";
    case 2:
      return "★★☆☆☆☆";
    case 1:
      return "★☆☆☆☆☆";
  }
}

function clearAllSelection() {
  let listOfButton = document.querySelector("#tag-list").querySelectorAll("a");
  listOfButton.forEach((button) => {
    if (button.className === "btn clicked"
      // && !button.textContent.includes("%")
    ) {
      let name = button.firstChild.nodeValue;
      button.className = "btn uncliked";
      let error = selected.delete(name);
      if (!error) alert("Previous removal unsuccessful. Element does not exist in the first place.");
    }
  });
  if (selected.size !== 0) {
    alert("Error: slection size !== 0 when cleared");
  }
}

function appendEmpty() {
  let empty = document.createElement("h3");
  empty.className = "center";
  empty.textContent = "没有结果的说~";
  document.querySelector("#result").appendChild(document.createElement("br"));
  document.querySelector("#result").appendChild(document.createElement("br"));
  document.querySelector("#result").appendChild(empty);
  document.querySelector("#result").appendChild(document.createElement("br"));
  document.querySelector("#result").appendChild(document.createElement("br"));
}

function clearAllResult() {
  // cleaning old calculation
  let old = document.querySelector("#result");
  while (old.firstChild) {
    old.removeChild(old.lastChild);
  }

  result5Star = [];
  result4Star = [];
  result3Star = [];
  result2Star = [];
  result1Star = [];
}

function init() {
  clearAllSelection();
  clearAllResult();
  // initialize selected set
  let listOfButton = document.querySelector("#tag-list").querySelectorAll("a");
  listOfButton.forEach((button) => {
    // set initial buttons containing % to clicked
    // if (button.textContent.includes("%")) {
    //   button.className = "btn clicked";
    //   let name = button.firstChild.nodeValue;
    //   selected.add(name);
    // }
  });
  appendEmpty();
}

function createWifu(stars, name, tagsList) {
  let li = document.createElement("li");
  let div = document.createElement("div");
  div.className = "floatbox";
  let sec = document.createElement("section");
  let h3 = document.createElement("h3");
  h3.innerText = getStars(stars) + " | " + name;
  let ol = document.createElement("ol");
  ol.className = "orderedlist";

  let listOfCodes = tagsList.map((set) => {
    let innerLi = document.createElement("li");
    Array.from(set).map((elem) => {
      let code = document.createElement("code");
      code.innerText = elem;
      return code;
    }).forEach((code) => {
      innerLi.appendChild(code);
      innerLi.appendChild(document.createTextNode(" "));
    });
    return innerLi;
  });
  listOfCodes.forEach((li) => {
    ol.appendChild(li);
  });

  sec.appendChild(h3);
  sec.appendChild(ol);
  div.appendChild(sec);
  li.appendChild(div);
  return li;
}

$(window).on("load", function () {
  init();

  // get the main chunk of html we want to process
  let tags = document.querySelector("#tag-list");

  // a list of tag category
  let listOfCategory = tags.querySelectorAll("li");

  // tags
  listOfCategory.forEach((lis) => {
    let buttons = lis.querySelectorAll("a");
    buttons.forEach((button) => {
      button.onclick = function () {
        let name = button.firstChild.nodeValue;

        if (button.className === "btn uncliked") {
          button.className = "btn clicked";
          selected.add(name);

        } else if (button.className === "btn clicked") {
          button.className = "btn uncliked";
          let error = selected.delete(name);
          if (!error) alert("Previous removal unsuccessful. Element does not exist in the first place.");
        }

      };
    })
  });

  let clear = document.querySelector("#clear");
  clear.onclick = init;

  let calculate = document.querySelector("#calculate");
  calculate.onclick = function () {
    clearAllResult();

    for (let wifuName in wifusDict) {
      let [stars, wifuTagSet] = wifusDict[wifuName];

      // search
      let result = new Set();
      for (let goodTags of wifuTagSet) {
        if (isSuperset(selected, goodTags)) {
          result.add(goodTags);
        }
      }

      // congregate result
      if (result.size !== 0) {
        if (stars == 5) {
          result5Star.push([wifuName, result]);
        } else if (stars == 4) {
          result4Star.push([wifuName, result]);
        } else if (stars == 3) {
          result3Star.push([wifuName, result]);
        } else if (stars == 2) {
          result2Star.push([wifuName, result]);
        } else {
          result1Star.push([wifuName, result]);
        }
      }

    }
    let myPopup = $().popup({
      content: "Done!",
      hidden: true,
      controls: {
        close: true,
      },
      header: false,
      transitionOnOpen: {
        top: false,
        right: true,
        bottom: true,
        left: false,
        fade: true
      },
    });
    myPopup.openPopup();
    setTimeout(function () { myPopup.closePopup(); }, 1000);


    // output
    let old = document.querySelector("#result");

    result5Star.map(([wifuName, result]) => {
      return createWifu(5, wifuName, Array.from(result));
    }).forEach((elem) => {
      old.appendChild(elem);
    });

    result4Star.map(([wifuName, result]) => {
      return createWifu(4, wifuName, Array.from(result));
    }).forEach((elem) => {
      old.appendChild(elem);
    });

    result3Star.map(([wifuName, result]) => {
      return createWifu(3, wifuName, Array.from(result));
    }).forEach((elem) => {
      old.appendChild(elem);
    });

    result2Star.map(([wifuName, result]) => {
      return createWifu(2, wifuName, Array.from(result));
    }).forEach((elem) => {
      old.appendChild(elem);
    });

    result1Star.map(([wifuName, result]) => {
      return createWifu(1, wifuName, Array.from(result));
    }).forEach((elem) => {
      old.appendChild(elem);
    });

    if (!old.firstChild) {
      appendEmpty();
    }

  };
});
